app/Controllers/Petugas/Book.php

    public function index()
    {
        $bookModel     = new BookModel();
        $categoryModel = new CategoryModel();

        $search    = $this->request->getGet('q');
        $kategori  = $this->request->getGet('kategori');
        $page      = (int) ($this->request->getGet('page') ?? 1);
        $perPage   = 8;

        $books = $bookModel->select('books.*, categories.nama as kategori')
            ->join('categories', 'categories.id=books.id_kategori', 'left');

        if ($search) {
            $books->groupStart()
                ->like('judul', $search)
                ->orLike('penulis', $search)
                ->orLike('isbn', $search)
                ->groupEnd();
        }
        if ($kategori) {
            $books->where('id_kategori', $kategori);
        }

        $booksList = $books->orderBy('books.id', 'DESC')->paginate($perPage, 'books');
        $categories = $categoryModel->orderBy('nama', 'ASC')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `books`
LEFT JOIN `categories` ON `categories`.`id`=`books`.`id_kategori`
WHERE   (
`judul` LIKE '%bumi%' ESCAPE '!'
OR  `penulis` LIKE '%bumi%' ESCAPE '!'
OR  `isbn` LIKE '%bumi%' ESCAPE '!'
 )
SELECT `books`.*, `categories`.`nama` as `kategori`
FROM `books`
LEFT JOIN `categories` ON `categories`.`id`=`books`.`id_kategori`
WHERE   (
`judul` LIKE '%bumi%' ESCAPE '!'
OR  `penulis` LIKE '%bumi%' ESCAPE '!'
OR  `isbn` LIKE '%bumi%' ESCAPE '!'
 )
ORDER BY `books`.`id` DESC
 LIMIT 8
SELECT *
FROM `categories`
ORDER BY `nama` ASC