app/Controllers/Petugas/Dashboard.php

    public function index()
    {
        $loanModel = new LoanModel();
        $returnModel = new ReturnModel();

        $today = date('Y-m-d');

        // Jumlah peminjaman hari ini
        $peminjamanHariIni = $loanModel
            ->where('tanggal_pinjam', $today)
            ->countAllResults();
        $loanModel->resetQuery();

        // Jumlah pengembalian hari ini
        $pengembalianHariIni = $returnModel
            ->where('tanggal_kembali', $today)
            ->countAllResults();
        $returnModel->resetQuery();

        // Grafik 7 hari terakhir: pinjam & kembali
        $labels = [];
        $dataPinjam = [];
        $dataKembali = [];
        for ($i = 6; $i >= 0; $i--) {
            $tanggal = date('Y-m-d', strtotime("-$i days"));
            $labels[] = date('d M', strtotime($tanggal));

            $dataPinjam[] = $loanModel->where('tanggal_pinjam', $tanggal)->countAllResults();
            $loanModel->resetQuery();

            $dataKembali[] = $returnModel->where('tanggal_kembali', $tanggal)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `loans`
WHERE `tanggal_pinjam` = '2025-06-19'
SELECT COUNT(*) AS `numrows`
FROM `returns`
WHERE `tanggal_kembali` = '2025-06-19'
SELECT COUNT(*) AS `numrows`
FROM `loans`
WHERE `tanggal_pinjam` = '2025-06-13'
SELECT COUNT(*) AS `numrows`
FROM `returns`
WHERE `tanggal_kembali` = '2025-06-13'