app/Controllers/Petugas/Peminjaman.php

SELECT `loans`.*, `users`.`username`, `books`.`judul`
FROM `loans`
JOIN `users` ON `users`.`id`=`loans`.`id_user`
JOIN `books` ON `books`.`id`=`loans`.`id_book`
ORDER BY `loans`.`id` DESC
---
    public function index()
    {
        $model = new LoanModel();
        $userModel = new UserModel();
        $bookModel = new BookModel();

        $peminjaman = $model->select('loans.*, users.username, books.judul')
            ->join('users', 'users.id=loans.id_user')
            ->join('books', 'books.id=loans.id_book')
            ->orderBy('loans.id', 'DESC')
            ->findAll();

SELECT *
FROM `loans`
WHERE `loans`.`id` = '6'
SELECT *
FROM `users`
WHERE `role` = 'siswa'
ORDER BY `username` ASC
SELECT *
FROM `books`
ORDER BY `judul` ASC
---
    public function edit($id) {
        $model = new LoanModel();
        $userModel = new UserModel();
        $bookModel = new BookModel();
        $peminjaman = $model->find($id);
        $siswa = $userModel->where('role', 'siswa')->orderBy('username', 'ASC')->findAll();
        $buku = $bookModel->orderBy('judul', 'ASC')->findAll();