app/Controllers/Petugas/Pengembalian.php

    public function index()
    {
        // Tampilkan daftar pengembalian buku (history returns)
        $returnModel = new ReturnModel();
        $data['pengembalian'] = $returnModel
            ->select('returns.*, loans.tanggal_pinjam, loans.tanggal_kembali as jatuh_tempo, users.username, books.judul')
            ->join('loans', 'loans.id=returns.id_loan')
            ->join('users', 'users.id=loans.id_user')
            ->join('books', 'books.id=loans.id_book')
            ->orderBy('returns.tanggal_kembali', 'DESC')
            ->findAll();
---
SELECT `returns`.*, `loans`.`tanggal_pinjam`, `loans`.`tanggal_kembali` as `jatuh_tempo`, `users`.`username`, `books`.`judul`
FROM `returns`
JOIN `loans` ON `loans`.`id`=`returns`.`id_loan`
JOIN `users` ON `users`.`id`=`loans`.`id_user`
JOIN `books` ON `books`.`id`=`loans`.`id_book`
ORDER BY `returns`.`tanggal_kembali` DESC

    public function add()
    {
        // Pinjaman yang statusnya masih 'approved' dan BELUM ADA di tabel returns (belum dikembalikan)
        $loanModel = new LoanModel();
        $loans = $loanModel
            ->select('loans.*, users.username, books.judul')
            ->join('users', 'users.id=loans.id_user')
            ->join('books', 'books.id=loans.id_book')
            ->where('loans.status', 'approved')
            ->where('NOT EXISTS (SELECT 1 FROM returns WHERE returns.id_loan = loans.id)', null, false)
            ->orderBy('loans.tanggal_pinjam', 'DESC')
            ->findAll();
---
SELECT `loans`.*, `users`.`username`, `books`.`judul`
FROM `loans`
JOIN `users` ON `users`.`id`=`loans`.`id_user`
JOIN `books` ON `books`.`id`=`loans`.`id_book`
WHERE `loans`.`status` = 'approved'
AND NOT EXISTS (SELECT 1 FROM returns WHERE returns.id_loan = loans.id)
ORDER BY `loans`.`tanggal_pinjam` DESC

    public function save()
    {
        $id_loan         = $this->request->getPost('loan_id');
        $tanggal_kembali = $this->request->getPost('tanggal_kembali');
        $keterangan      = $this->request->getPost('keterangan');
        $dendaPerHari    = 1000;

        $loanModel   = new LoanModel();
        $returnModel = new ReturnModel();
        $loan = $loanModel->find($id_loan);

        if (!$loan) {
            return redirect()->back()->withInput()->with('errors', ['Data peminjaman tidak ditemukan']);
        }

        // Hitung denda
        $jatuhTempo = $loan['tanggal_kembali'];
        $hariTerlambat = 0;
        $denda = 0;
        if ($jatuhTempo && $tanggal_kembali > $jatuhTempo) {
            $hariTerlambat = (strtotime($tanggal_kembali) - strtotime($jatuhTempo)) / 86400;
            $hariTerlambat = (int) $hariTerlambat;
            $denda = $hariTerlambat * $dendaPerHari;
        }

        // Simpan ke tabel returns
        $returnModel->insert([
            'id_loan'         => $id_loan,
            'tanggal_kembali' => $tanggal_kembali,
            'denda'           => $denda,
            'keterangan'      => $keterangan
        ]);

        // Update status loan menjadi "returned"
        $loanModel->update($id_loan, ['status' => 'returned']);
---
SELECT *
FROM `loans`
WHERE `loans`.`id` = '6'
INSERT INTO `returns` (`id_loan`, `tanggal_kembali`, `denda`, `keterangan`) VALUES ('6', '2025-06-19', 0, '')
UPDATE `loans` SET `status` = 'returned'
WHERE `loans`.`id` IN ('6')