app/Models/LaporanModel.php

    public function getLaporan($filters = [])
    {
        $builder = $this->select('loans.*, users.username, books.judul')
            ->join('users', 'users.id = loans.id_user')
            ->join('books', 'books.id = loans.id_book');

        if (!empty($filters['status'])) {
            $builder->where('loans.status', $filters['status']);
        }
        if (!empty($filters['from']) && !empty($filters['to'])) {
            $builder->where('tanggal_pinjam >=', $filters['from']);
            $builder->where('tanggal_pinjam <=', $filters['to']);
        }

        return $builder->orderBy('loans.id', 'DESC')->findAll();
---
SELECT `loans`.*, `users`.`username`, `books`.`judul`
FROM `loans`
JOIN `users` ON `users`.`id` = `loans`.`id_user`
JOIN `books` ON `books`.`id` = `loans`.`id_book`
WHERE `tanggal_pinjam` >= '2025-06-19'
AND `tanggal_pinjam` <= '2025-06-19'
ORDER BY `loans`.`id` DESC